# Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в 
# пример:
# in: 
# >> gipopotampo
# >> po
# out:
# >> 3

n = input()
m = input()

print(n.count(m))