# 3. Функция принимает в качестве аргументов имена сотрудников, возвращает словарь,
#  ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# Иван, Мария, Петр, Илья, Марина, Петр, Алина, Бибочка

# out

# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


def names(string):
    str_names = (string.split(sep = ', '))
    dict_names = {}

    print(str_names)

    for i in range(len(str_names)):
        key = str_names[i][0]
        if key not in dict_names:
            dict_names[key] = []
        dict_names[key].append(str_names[i])
    
    print(dict(sorted(dict_names.items())))

names(input('Введите имена сотрудников: '))