# 1. Напишите программу, которая принимает на вход
# вещественное число и показывает сумму его цифр.
# Без работы с методами строк.
# in -> out
# - 6782 -> 23
# - 0.67 -> 13
# - 198.45 -> 27


n = input("Введите вещественное число: ")
sum = 0

power = len(n) - 2

n = float(n)
n = n * (10 ** power)

while n > 0:
    sum += int(n % 10)
    n //= 10

print(sum)
